#3. Напишите программу, в которой пользователь будет задавать две строки, а программа - определять количество вхождений одной строки в другой.
print('Введите первую строку: ')
str1 = 'aaababaewfwef'
str2 = 'aba'

count = 0

for i in range(len(str1) - (len(str2) - 1)):
    if str2 == str1[i:i+len(str2)]:
        count += 1


print(f"Вторая строка входит в первую {count} раз(а).")
