##Напишите программу, которая определит позицию второго вхождения строки в списке либо сообщит, что её нет.

#*Пример:*

# список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3
# список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], ищем: "йцу", ответ: 5
# список: ["йцу", "фыв", "ячс", "цук", "йцукен"], ищем: "йцу", ответ: -1
# список: ["123", "234", 123, "567"], ищем: "123", ответ: -1
# список: [], ищем: "123", ответ: -1

find_str = input('Введите строку, которую хотите найти: ')
lst = ["qwe", "asd", "zxc", "qwe", "ertqwe"]
if lst.count(find_str) < 2:
    print(-1)
else:
    print(lst.index(find_str, lst.index(find_str) + 1))

#print(lst.index(find_str))

